src/cf/DataProcessors/bon_РабочаяОбрасть.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>bon_РабочаяОбрасть</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/bon_ТелефоныНомОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_ТелефоныНомОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотовый</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>bon_НоминальныеОбъекты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/bon_РезультатСработыванияПоСчетчику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_РезультатСработыванияПоСчетчику</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоКратности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСумме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоУсловиюВоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МаркетинговаяАкция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.bon_МакетинговыеАкции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПредзаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоложСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/bon_СчетчикПокупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>bon_СчетчикПокупок</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>bon_НоминальныеОбъекты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/bon_СтатистикаРекламы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_СтатистикаРекламы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОткудаВыУзналиОНас</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦС_Опрос</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>bon_НоминальныеОбъекты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/bon_РабочаяОбрасть/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура bon_УправлениеБонусамиНаСчетах(Команда)
	ОткрытьФорму("Документ.bon_УправлениеБонусамиНаСчетах.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_МакетинговыеАкции(Команда)
	ОткрытьФорму("Документ.bon_МакетинговыеАкции.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_ВводВОборотНоминальныхОбъектов(Команда)
	ОткрытьФорму("Документ.bon_ВводВОборотНоминальныхОбъектов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_РегистрацияНоминальныхОбъектов(Команда)
	ОткрытьФорму("Документ.bon_РегистрацияНоминальныхОбъектов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_ВыводИзОборотаНоминальныхОбъектов(Команда)
	ОткрытьФорму("Документ.bon_ВыводИзОборотаНоминальныхОбъектов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_НоминальныеОбъекты(Команда)
	ОткрытьФорму("Справочник.bon_НоминальныеОбъекты.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_ВидыНоминальныхОбъектов(Команда)
	ОткрытьФорму("Справочник.bon_ВидыНоминальныхОбъектов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_ХарактеристикиБонусов(Команда)
	ОткрытьФорму("Справочник.bon_ХарактеристикиБонусов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_ТелефоныНомОбъектов(Команда)
	ОткрытьФорму("РегистрСведений.bon_ТелефоныНомОбъектов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_УсловиеСчетчикаКратности(Команда)
	ОткрытьФорму("РегистрСведений.bon_УсловиеСчетчикаКратности.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_ВыдаваемыеЦенности(Команда)
	ОткрытьФорму("РегистрСведений.bon_ВыдаваемыеЦенности.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_РезультатСработыванияПоСчетчику(Команда)
	ОткрытьФорму("РегистрСведений.bon_РезультатСработыванияПоСчетчику.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_СведенияОНоминальныхОбъектах(Команда)
	ОткрытьФорму("РегистрСведений.bon_СведенияОНоминальныхОбъектах.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_СостоянияНоминальныхОбъектов(Команда)
	ОткрытьФорму("РегистрСведений.bon_СостоянияНоминальныхОбъектов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_ПартииБонусовНаСчетах(Команда)
	ОткрытьФорму("РегистрНакопления.bon_ПартииБонусовНаСчетах.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_СчетчикПокупок(Команда)
	ОткрытьФорму("РегистрНакопления.bon_СчетчикПокупок.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_РегистрацияБонусногоСчетаКлиента(Команда)
	ОткрытьФорму("Обработка.bon_РегистрацияБонусногоСчетаКлиента.Форма.ФормаРег");
КонецПроцедуры

&НаКлиенте
Процедура bon_ПодразделенияДляАкций(Команда)
	ОткрытьФорму("РегистрСведений.bon_ПодразделенияДляАкций.ФормаСписка");
КонецПроцедуры

&НаКлиенте                                           
Процедура bon_СтатистикаРекламы(Команда)
	ОткрытьФорму("РегистрСведений.bon_СтатистикаРекламы.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_ОбработкаСМС(Команда)
	ОткрытьФорму("Обработка.bon_ОбработкаСМС.Форма.ФормаУФ");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонстан(Команда)
	ОткрытьФорму("ОбщаяФорма.bon_ФормаКонстант"); 
КонецПроцедуры

&НаКлиенте
Процедура bon_НакопительныеПрограммы(Команда)
	ОткрытьФорму("Справочник.bon_НакопительныеПрограммы.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_ПараметрыНакопительныхПрограмм(Команда)
	ОткрытьФорму("РегистрСведений.bon_ПараметрыНакопительныхПрограмм.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_НастройкаБонусов(Команда)
	ОткрытьФорму("РегистрСведений.bon_НастройкаБонусов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_Исключение_Бонусов(Команда)
	ОткрытьФорму("РегистрСведений.bon_Исключение_Бонусов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_Наст_Нач_и_Спис_Бонусов_ПоНоменклотуре(Команда)
	ОткрытьФорму("РегистрСведений.bon_Наст_Нач_и_Спис_Бонусов_ПоНоменклотуре.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_НастройкаХарактеристикБонусов(Команда)
	ОткрытьФорму("Документ.bon_НастройкаХарактеристикБонусов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура bon_ПодразделенияУчаствующиеВБонуснойСистеме(Команда)
	ОткрытьФорму("РегистрСведений.bon_ПодразделенияУчаствующиеВБонуснойСистеме.ФормаСписка");
КонецПроцедуры
